function CW2_1
    clear,clc
    
    a=1; b=3; hv=0.2;
    n = 19; X = linspace(a, b, n); 
    Y = zeros(1, n);  % вектор розв'язку

    h = 0.01; %беру менший крок, бо з тим що в умові у солвера матлаб якісь проблеми, особливо починаючи з точки 3.2 
    % Початкові умови (Y - для Рунге, YY - для ode)
    Y(1) = 2; Y2 = Y;
    for i = 2 : n
    % Знаходимо розв'язок на інтервалах
        k = i - 1; y = Y(k);
        y = runge(@f91, X(k), X(i), h, y);
        Y(i) = y;
        ye = Y(k);
        [x, y] = ode45(@f91, [X(k) X(i)], ye);
        % з y беремо кінцеве значення (в точці X(k))
        m = length(y); Y2(i) = y(m);
    end

    
    plot(X, Y, 'r--', X, Y2, 'c.-','LineWidth',1.5) 
    grid on
    grid minor
    xlabel('x'), ylabel('u(x)')
    legend('Рунге','ode45')
    title('u`=sin(2*x)-(cos(2-x)+2.34*x)*u^2, u(1)=2')
    
end



function y = runge(f, x1, x2, h, y)
%  Вхідні параметри :
%   f - права частина диф рівняння;
%   x1=а- початок відрізка;
%   x2=b- кінець відрізка;
%   h -крок інтегрування;
%   y - значення функції в точці x=a;
%  Вихідні параметри :
%   y - значення функції в точці x=b.
     
    x = x1;
    while x < x2
        K1 = f(x, y);
        x = x + h*0.5;
        K2 = f(x, y + (h*0.5) .* K1);
        x=x+h;
        K3=f(x, y+h.*(2.*K2-K1));
        y = y + (h/6) .* (K1 + 4.*K2+K3);
    end
end

function F = f91(x,u)
% підфункція правої частини системи
F = sin(2.*x)-(cos(2-x)+2.34.*x).*u.^2;
end