% Розв'язання Кр. зад. завд 2 засобами Matlab: bvp4c, bvpinit.

a = 1;    b = 3;					% Межі відрізку
q = @(x) -2.7.*sqrt(x)-1.23;					% Коефіцієнт рівняння при u (ліва частина)
f = @(x) (4.*(x.^2)+1)./sqrt(x.^3);		% Вільний член рівняння (права частина)
g0 = 1;   g1 = 0;					% Праві частини КУ
F = @(x,u) [u(2);...				% Функція, що переписує ЗДР 2-го порядку
			-q(x)*u(1)+f(x)];
G = @(ua,ub) [ua(2)+ua(1)-g0; ...	% Функція крайових умов для системи ЗДР
				  ub(2)+3.*ub(1)-g1];
x = [a b];							% Вектор, який визначає проміжок зміни незалежної
										% змінної
u_init = [0 0];					% Вибираємо довільний вектор довжини 2 (система з 
										% 2х рівнянь) для ініціалізації розв'язку
solinit = bvpinit(x,u_init);	% Ініціалізуємо структкру, що буде містити 
										% розв'язок кр. задачі
sol = bvp4c(F,G,solinit);		% Розв'язуємо кр. задачу для системи
x = linspace(a,b,21);			% Сітка для зображення
u = deval(sol,x);					% Обчислення знайденого розв'язку на x
plot(x,u(1,:),'b-')
grid on									% Зображення знайденого розв'язку 
legend('Наближений роз.')	