% 30 - tem12
% Використовуючи системний редактор текстів, створити М-файл з ім’ям tem12.m, 
% у якому ввести вектор-рядок X розмірністю 10 і вектор-стовпець Y розмірністю 10. 
% Виконати нормування векторів і знайти косинус кута між векторами X та Y. 
% Зберегти цей файл і виконати його.
X = [1:0.5:5.5]
Y = [10; 9; 8; 7; 6; 5; 4; 3; 2; 1]

N1 = normalize(X)
N2 = normalize(Y)

a = X(1)*Y(1) + X(2)*Y(2) + X(3)*Y(3) + X(4)*Y(4) + X(5)*Y(5) + X(6)*Y(6) + X(7)*Y(7) + X(8)*Y(8) + X(9)*Y(9) + X(10)*Y(10) % скалярний добуток векторів X та Y
a = dot(X,Y)
b1 = sqrt(X(1)^2 + X(2)^2 + X(3)^2 + X(4)^2 + X(5)^2 + X(6)^2 + X(7)^2 + X(8)^2 + X(9)^2 + X(10)^2) % довжина вектора X
b1 = norm(X)
b2 = sqrt(Y(1)^2 + Y(2)^2 + Y(3)^2 + Y(4)^2 + Y(5)^2 + Y(6)^2 + Y(7)^2 + Y(8)^2 + Y(9)^2 + Y(10)^2) % довжина вектора Y
b2 = norm(Y)
c = a/(b1*b2) %косинус угла між векторами X та Y

% 31 - tem13
% Створити командою edit М-файл з ім’ям tem13.m, у якому ввести вектори a, b, c 
% розмірністю 3*1. Знайти векторний добуток векторів a та b (вектор x) і число 
% Н=|abc| – змішаний добуток векторів a, b, c. Зберегти цей файл і виконати його.
a = [1 2 3]
b = [4 5 6]
c = [7 8 9]

A1 = dot(a,b)
B1 = dot(b,c)
C1 = dot(a,c)

A2 = cross(a,b)
x = A2
B2 = cross(b,c)
C2 = cross(a,c)

H = dot(a,B2)

% 32 - tem14
% Створити командою edit М-файл з ім’ям tem14.m, у якому ввести вектор X, із 
% цілочисельними компонентами з проміжку [5, 10]. Знайти значення виразу 
% S = ((A^(2/3))*sqrt(C^3))/((B + D)^2), де  
% A=(sin(X)cos(X))^2, B=(ln(X+2))/X, C=(exp(X/X2))^-2, D=A+B.
X = [5:2:10]

A = (sin(X).*cos(X)).^2
B = (log(X+2))/X
C = (exp(X/(X.^2))).^(-2)
D = A+B

S = ((A.^(2/3))*sqrt(C^3))/((B + D).^2)

% 34 - tem15
% Відобразити значення системних змінних pi, eps, realmin, realmax.
a = pi
b = eps
c = realmin
d = realmax

% 35
% Записати кілька прикладів обчислення предиката.
s = input("s = ")
r = input("r = ")
q = input("q = ")

predA = logical(s*r)
predB = logical(s*r~=1)
predC = logical(s*r~=0)
predD = logical(s*r==2)
predE = logical(s*r==0)
predF = logical(s/q)
predG = logical(s/q~=1)
predH = logical(s/q~=0)
predI = logical(s/q==2)
predJ = logical(s/q==0)
predK = logical(q^s)
predL = logical(q^s~=1)
predM = logical(q^s~=0)
predN = logical(q^s==2)
predO = logical(q^s==0)

% 36 (делали на лекции)

% 37 
% Записати кілька прикладів обчислення булевого виразу.
p = input("p = ")
q = input("q = ")
r = input("r = ")
x = input("x = ")
y = input("y = ")

bul1 = or(p,q)
bul2 = and(p,and(q,r))
bul3 = ("q implication p");
if and(q == 0, or(p == 0, p == 1))
    bul3 = 1
elseif and(q == 1, p == 0)
    bul3 = 0
elseif and(q == 1, p == 1)
    bul3 = 1
end
bul4 = x < or(y,x) == y
bul5 = and(y >= x, and(y + x >= 0, y <= 1))
bul6 = and(((x - 1)^2) + ((y - 2)^2) >= 9, ((x - 3)^2) + ((y + 1)^2 <= 25))

% 38 
% За вектором Z [1-2i, 1+3i, 1+2i, 2, 5i, 0] створити матрицю: перший рядок – 
% це модуль відповідних компонент вектора Z, другий – аргумент, третій – дійсна 
% частина, четвертий – уявна частина. Визначити, скільки часу (у секундах) 
% витрачається на виконання цієї вправи(матрица из комплексных чисел).
Z = [1-2i, 1+3i, 1+2i, 2, 5i, 0] 
a1 = norm(Z(1)) % модуль каждой компоненты вектора Z
a2 = norm(Z(2))
a3 = norm(Z(3))
a4 = norm(Z(4))
a5 = norm(Z(5))
a6 = norm(Z(6))

b1 = angle(Z(1)) % аргумент каждой компоненты вектора Z 
b2 = angle(Z(2))
b3 = angle(Z(3))
b4 = angle(Z(4))
b5 = angle(Z(5))
b6 = angle(Z(6))

c1 = real(Z(1)) % действительная часть каждой компоненты вектора Z
c2 = real(Z(2))
c3 = real(Z(3))
c4 = real(Z(4))
c5 = real(Z(5))
c6 = real(Z(6))

d1 = imag(Z(1)) % мнимая часть каждой компоненты вектора Z
d2 = imag(Z(2))
d3 = imag(Z(3))
d4 = imag(Z(4))
d5 = imag(Z(5))
d6 = imag(Z(6))

W = [a1 a2 a3 a4 a5 a6; b1 b2 b3 b4 b5 b6; c1 c2 c3 c4 c5 c6; d1 d2 d3 d4 d5 d6;]

% 39
% Для вектора Z із завдання 38 знайти скалярний добуток Z на Z*.
R = conj(Z)
dot(Z,R)

% 40
% Знайти найбільший спільний дільник і найменше спільне кратне заданих цілих чисел m і n.
m = 2
n = 5
l = lcm(m,n) %НОК

g = gcd(m,n) %НОД

% 41
% Задати довільне дійсне число Y. Знайти його зображення у вигляді ланцюгового 
% та раціонального дробу.
Y = pi
rat(Y)
[N,D] = rat(Y)
S = rats(Y)
S = rats(Y,6)

% 42
% Задано одновимірний масив дійсних чисел X = [–1.9 –0.2  3.4  5.6  7.0]. Побудувати 
% масиви чисел  X1, X2, X3, X4, елементами яких будуть значення компонент масиву X, що
% а) заокруглені до найближчого цілого, більшого або рівного відповідному елементу X;
% б) заокруглені до найближчого цілого, меншого або рівного відповідному елементу X;
% в) заокруглені до найближчого цілого;
% г) отримані відкиданням дробової частини числа.
X = [-1.9 -0.2 3.4 5.6 7.0]
X1 = ceil(X) % функция Y = ceil(X) возвращает значения, округленные до ближайшего целого большему или равному X
X2 = floor(X) % функция Y = floor(X) возвращает значения, округленные до ближайшего целого меньшему или равному X
X3 = round(X) % функция Y = round(X) возвращает значения, округленные до ближайшего целого
X4 = fix(X) % функция Y = fix(X) возвращает значения с усечением дробной части числа

% 43
% Для двох заданих дійсних чисел x і y обчислити залишок від ділення x на y.
x = 10
y = 6
b = mod(x,y)
