clear, clc
f = @(x) cosh(x/2)-5; % Функція для інтерполювання
df=@(x) (sinh(x/2))/2;
a=4; b=6; % Межі відрізка
h=0.2;
n=8; % Степінь інтерполяційного% полінома
X = linspace(a,b,n+1); % Інтерполяційна сітка
Y = f(X); % Значення функції у вузлах інтерполяційної сітки
P = polyfit(X,Y,n); % Інтерполяційний поліном
xx = linspace(a,b,10*n+1); % Допоміжна сітка для малювання графіків
y1 = f(xx); % Значення функції на допоміжній сітці
y2 = polyval(P,xx); % Значення інтерполяційного полінома на допоміжній сітці
plot(xx,y1,'r -',xx,y2, 'b --','LineWidth',1.5), grid
df1=polyder(P); %похідна від поліному
t=input('ввести число для обчислення похідної');
pol=polyval(df1,t); %значення похідної поліному в точці t
fun=df(t);
disp(['похідна від ІП   ' , num2str(pol), '   Точне значення  ', num2str(fun)]);
It1 = h .* trapz(Y);
Isd = quadl(f, a, b);
disp(['Інтеграл по м.трапецій= ',num2str(It1),'  по Сімпсону ',num2str(Isd)]);
