clear, clc
f2=@(x) nthroot((4*(x.^2)+20),3); %Очевидно що функція не має нулів, можемо все ж перевірити
f1=@(x) nthroot((4*(x.^2)-20),3); %спочатку перевіримо на функції що має корені
%квадратне рівняння, отже шукаємо 2 корені 
xl=0;
xr=100;
l=-100;
r=0;

[x1,k1]=m_div2(f1,xl,xr,1e-7);
[x2,k2]=m_div2(f1,l,r,1e-7);
disp(['перший корінь ', num2str(x1),'  другий корінь ', num2str(x2)])
g=fminbnd(f1,0,100);
n=10; 
xx = linspace(-5,5,10*n+1); % Допоміжна сітка для малювання графіків
y1 = f1(xx); % Значення функції f1 на допоміжній сітці
y2 = f2(xx); % Значення функції f2 на допоміжній сітці
plot(xx,y1,'r -', xx,y2, 'b -','LineWidth',1.5), grid %перевіримо по малюнку
[x3,k3]=m_div2(f2,l,r,1e-7);

