f = @(x,y) (-2.*x.*y.^2)./(1+x.^2) + (x.^2)./(1+y.^2*x);	% Права частина рівняння
t = 0:0.01:2;					% Часова сітка
Y = zeros(size(t));			% Вектор майбутнього розв'язку
Y(1) = 0.5;						% Початкове значення розв'язку береться з ПУ
for i = 1:length(t)-1
	F = @(z) z-Y(i)-0.5*(t(i+1)-t(i))*(f(t(i),Y(i))+f(t(i+1),z));
									% Функція для розв'язання рівняння, яке визначає
									% Y(i+1) (неявна схема)
	Y(i+1) = fzero(F,Y(i));	% Відшукання Y(i+1) в ході неявної схеми
end
plot(t,Y,'r-','LineWidth',1.5) 
grid
hold on
pause
[tt,YY] = ode23(f,[t0 T],u0);
plot(tt,YY,'bo ','LineWidth',1.5,'MarkerSize',4)
hold off