function [x,k]=m_div2(f,a,b,tol)

% Функція для розв'язання рівняння f(x)=0 на відрізку [a,b] з точністю tol
% методом дихотомії.

% Результати:
% x - наближений розв'язок рівняння, якщо він знайдений, або NaN, якщо ні.

switch nargin
	case [0 1 2 3]
		error('dich: недостатня кількість параметрів')
end
if f(a)*f(b)>0
	error('dich: не виконується умова використання методу')
end
if tol>1| tol<0
	error('dich: не правильно введено точність')
end

k=0; %кількість ітерацій
while abs(b-a)>tol
	x = (a+b)/2;
	if f(a)*f(x)<=0
		b = x;
	else
		a = x;
    end
   k=k+1; 
end
x = (a+b)/2;	%  Покращення точності у 2 рази

end
