%третє завдання з контрольної роботи
clear
clc
syms x; %символьно задана змінна
f = (x.^2*(x+2))/(x.^2+2*x+5); %сама наша функція
T = taylor(f,x,'Order',7)%Розкладання символьно заданої функції F у ряд Тейлора.
% За замовчуванням обчислюється у точці a = 0, до п*ятого степеня (n = 6)
% Тому в дужках окрім функції вкажемо x,name та, щоб степінь була 6, n=7;
T = simplify((T));% simplify(S) спрощення виразу S; collect(S,var) перетворення виразу 
% S в поліном з обчисленням коефіцієнтів при степенях незалежної змінної var.
T = collect(T); %collect(S,var) перетворення виразу S в поліном з обчисленням 
% коефіцієнтів при степенях незалежної змінної var
F = int(T,x); %int(F,x),Обчислення інтегралу від символьної функції F.
% x – необов*язкова змінна, змінна інтегрування;
R = diff(F,x);%diff (S),diff (S,y),Обчислення n–тої похідної 
% (за замовчуванням – першої)від СВ S за незалежною змінною x
U = simplify(R);
K = collect(U);
if K==T %перевірка чи будуть функції однакові
    disp('Похідна від функції F(x) дорівнює функції T(x) ')
elseif K~=T
    disp ('Похідна від функції F(x) не дорівнює функції T(x)')
else 
    disp('Щось взагалі пішло не так')
end
%Побудова графіків функції f(x) T(x) для xe[0,2]
fplot(T,[0,2],'Linewidth',2), hold on; %взагалі в книжці написана функція ezplot, але сам матлаб запропонував 
% або fplot, або fimplicit, тому я обрала перше;
fplot(f,[0,2], '-.*c'), title('Графіки функцій f(x) та T(x)'),hold off
legend('функція - T(x)','функція - f(x)')


