% №1.Команди мови, як і команди у командному вікні, записуються по одній у фізичний рядок.Якщо після запису тексту команди відсутній розділювач " ; ",
% то після виконання цієї команди на екран буде виведено результат. За наявності знаку " ; " здійснюється блокування виведення.
% Для запису декількох команд в одному фізичному рядку використовується розділювач " , " (без блокування виведення) або розділювач " ; ". Частину довгого виразу можна перенести на
%наступний рядок за допомогою символу "…".
% №2.Оператор присвоення:
%Синтаксис: x = E, де x – ім'я змінної,  E – вираз.
%Семантика реалізується так : обчислюємо значення (позначимо його через e) виразу E у правій частині оператора, яке і стає значенням змінної x.
% В MATLAB пам'ять під змінні заздалегідь не виділяється, тому, якщо змінна x не існує, то вона створюється. 
% У випадку існування x попереднє значення змінної x стає недосяжним, а тип x приводиться до class(e).

%№3
x=input('x=' ) 
if x>10
    x=x+2;
else
    x=x;
end

%№4
x=input('x=') 
if x+2<5
    disp ('ви ввели маленьке число');
end

%№5
x=input('x=')
if x>=-1 & x<=1
    y=-x;
elseif x>-2 & x<-1
    y=x+2;
elseif x>1 & x<2
    y=2-x;
else
    y=0;

end
disp(strcat('y=',num2str(y)))

%6.Гороскоп 
s= input('s=1-12?')
s=num2str(s);
switch s
    case {'1'}
        disp('овен');
    case {'2'}
        disp ('телец');
    case {'3'}
        disp('Близнюки');
    case {'4'}
        disp ('Рак');
    case {'5'}
        disp('Лев');
    case {'6'}
        disp ('Діва'); 
    case {'7'}
        disp('Терези');
    case {'8'}
        disp ('Скорпіон');
    case {'9'}
        disp('Стрілець');
    case {'10'}
        disp ('Козеріг'); 
    case {'11'}
        disp('Водолій');
    case {'12'}
        disp ('Риби');    
    otherwise
        disp('введено неправильне значення');
end


%7.Оператор циклу з передумовою:
%Синтаксис:
while F  % заголовок циклу
    P;  % ”тіло” циклу
end   % кінець циклу
%Семантика: поки значення умови F є істинним, виконується група команд P тіла циклу. Коли значення F стає хибним, то здійснюється вихід з циклу

%№8. Синтаксис оператора циклу за діапазоном значень (цикл з лічильником):
for k = e1 : e2 : e3 % заголовок циклу
    P; % ”тіло” циклу
end % кінець циклу
%Тут k – змінна циклу (лічильник), e1,e3 – початкове і кінцеве значення діапазону, e2– крок (при значенні +1 його можна не вказувати) на який змінюється k після
%кожного виконання групи команд P. Цикл закінчується, якщо значення лічильника виходить за межі вказаного діапазону.можна використовувати й інші варіанти завдання діапазону:

%9. Оператор введення 
A=input('введіть якесь число')

%10.Виведення disp(A), display(A)


